
Math.max([10,20,30]) // 오류
// 오류나는코드
Math.max([10, 20, 30])
Math.max([10, 20, 30, [11, 12, 13, [29, 40, 50]]])
Math.max([10, 20, 30, [11, 12, 13, [29, 40, 50]]].flat(Infinity))



//되는 코드
Math.max(...[10, 20, 30])  //30
Math.min(...[10, 20, 30])  //10
Math.max(...[10, 20, 30, [11, 12, 13, [29, 40, 50]]].flat(Infinity))
//flat 해서 핀 후 전개를해야하므로 ...을 붙인다



//자주사용되는 코드
const s = 'hello world';

[s] //['hello world']
[...s] // ['h', 'e', 'l', 'l', 'o', ' ', 'w', 'o', 'r', 'l', 'd']  // s.split('')과 결과가 같다 